{
    "format": "graph-model",
    "generatedBy": "2.13.0",
    "convertedBy": "TensorFlow.js Converter v4.9.0",
    "signature": {
        "inputs": {
            "input": {
                "name": "input:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "384" },
                        { "size": "384" },
                        { "size": "3" }
                    ]
                }
            },
            "hi1": {
                "name": "hi1:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "20" },
                        { "size": "24" },
                        { "size": "24" }
                    ]
                }
            },
            "hi3": {
                "name": "hi3:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "12" },
                        { "size": "96" },
                        { "size": "96" }
                    ]
                }
            },
            "hi4": {
                "name": "hi4:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "10" },
                        { "size": "192" },
                        { "size": "192" }
                    ]
                }
            },
            "hi2": {
                "name": "hi2:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "16" },
                        { "size": "48" },
                        { "size": "48" }
                    ]
                }
            }
        },
        "outputs": {
            "ho1": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "20" },
                        { "size": "24" },
                        { "size": "24" }
                    ]
                }
            },
            "output": {
                "name": "Identity_4:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "1" },
                        { "size": "384" },
                        { "size": "384" }
                    ]
                }
            },
            "ho2": {
                "name": "Identity_1:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "16" },
                        { "size": "48" },
                        { "size": "48" }
                    ]
                }
            },
            "ho4": {
                "name": "Identity_3:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "10" },
                        { "size": "192" },
                        { "size": "192" }
                    ]
                }
            },
            "ho3": {
                "name": "Identity_2:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "12" },
                        { "size": "96" },
                        { "size": "96" }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "PartitionedCall/SelectV2_17",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "1" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/zeros_4",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_44",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/Shape_4",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/SelectV2_18",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "1" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_43",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/ExpandDims_4",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": {
                                "dim": [{ "size": "1" }, { "size": "1" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Cast_14",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "1" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_45",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/decoder/convGRU4/gru_cell/Concat/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Const_34",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_138/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/split_37",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "20" },
                                    { "size": "20" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "unknown_97",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "20" }] }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/transpose_139/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Const_35",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "2" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/decoder/convGRU4/gru_cell/Split/split_dim",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/decoder/convGRU4/gru_cell/Concat_1/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Const_36",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_141/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/split_38",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "20" },
                                    { "size": "10" }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "unknown_99",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "10" }] }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/transpose_142/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_6/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/decoder/convGRU3/gru_cell/Concat/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Const_26",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_127/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/split_34",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "24" },
                                    { "size": "24" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "unknown_89",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "24" }] }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/transpose_128/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_27",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "2" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/decoder/convGRU3/gru_cell/Split/split_dim",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/decoder/convGRU3/gru_cell/Concat_1/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Const_28",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_130/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/split_35",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "24" },
                                    { "size": "12" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "unknown_91",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "12" }] }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/transpose_131/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_8/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/decoder/convGRU2/gru_cell/Concat/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Const_18",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_116/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/split_31",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "32" },
                                    { "size": "32" }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "unknown_81",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "32" }] }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/transpose_117/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_19",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "2" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/decoder/convGRU2/gru_cell/Split/split_dim",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/decoder/convGRU2/gru_cell/Concat_1/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Const_20",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_119/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/split_32",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "32" },
                                    { "size": "16" }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "unknown_83",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "16" }] }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/transpose_120/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_10/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "unknown_70",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/decoder/convGRU1/gru_cell/Concat/axis",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_10",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_105/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/split_28",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "40" },
                                    { "size": "40" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "unknown_69",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "40" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_106/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Const_11",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "2" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/decoder/convGRU1/gru_cell/Split/split_dim",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/decoder/convGRU1/gru_cell/Concat_1/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Const_12",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_108/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/split_29",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "40" },
                                    { "size": "20" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "unknown_72",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "20" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_109/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_99/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/split_25",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "1" },
                                    { "size": "1" },
                                    { "size": "80" },
                                    { "size": "40" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "unknown_66",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "40" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_100/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_/_net/encoder/8/block/1/2/Div_recip",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_/_net/encoder/8/block/0/2/Div_recip",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/split_23",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "1" },
                                    { "size": "1" },
                                    { "size": "80" },
                                    { "size": "200" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "unknown_60",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "200" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_91/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_8",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_93/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Reshape_7",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "200" },
                                    { "size": "1" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "unknown_62",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "200" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_94/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_96/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/split_24",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "1" },
                                    { "size": "1" },
                                    { "size": "200" },
                                    { "size": "80" }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "unknown_64",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "80" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_97/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_/_net/encoder/7/block/1/2/Div_recip",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_/_net/encoder/7/block/0/2/Div_recip",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_/_net/encoder/6/Div_recip",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "ConstantFolding/PartitionedCall/split_17-folded-1",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "2" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_72/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/split_18",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "1" },
                                    { "size": "1" },
                                    { "size": "120" },
                                    { "size": "32" }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "unknown_48",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "32" }] }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/transpose_73/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_75/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
