{
    "format": "graph-model",
    "generatedBy": "2.13.0",
    "convertedBy": "TensorFlow.js Converter v4.9.0",
    "signature": {
        "inputs": {
            "input": {
                "name": "input:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "384" },
                        { "size": "384" },
                        { "size": "3" }
                    ]
                }
            },
            "hi4": {
                "name": "hi4:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "10" },
                        { "size": "192" },
                        { "size": "192" }
                    ]
                }
            },
            "hi3": {
                "name": "hi3:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "12" },
                        { "size": "96" },
                        { "size": "96" }
                    ]
                }
            },
            "hi1": {
                "name": "hi1:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "20" },
                        { "size": "24" },
                        { "size": "24" }
                    ]
                }
            },
            "hi2": {
                "name": "hi2:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "16" },
                        { "size": "48" },
                        { "size": "48" }
                    ]
                }
            }
        },
        "outputs": {
            "ho3": {
                "name": "Identity_2:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "12" },
                        { "size": "96" },
                        { "size": "96" }
                    ]
                }
            },
            "output": {
                "name": "Identity_4:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "1" },
                        { "size": "384" },
                        { "size": "384" }
                    ]
                }
            },
            "ho2": {
                "name": "Identity_1:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "16" },
                        { "size": "48" },
                        { "size": "48" }
                    ]
                }
            },
            "ho4": {
                "name": "Identity_3:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "10" },
                        { "size": "192" },
                        { "size": "192" }
                    ]
                }
            },
            "ho1": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        { "size": "1" },
                        { "size": "20" },
                        { "size": "24" },
                        { "size": "24" }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "PartitionedCall/Cast_19",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "2" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_176/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net2/ReduceMean/reduction_indices",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net2/Concat_1/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Const_55",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_164/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Reshape_18",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "4" },
                                    { "size": "1" }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_165/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/SelectV2_17",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "1" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/zeros_4",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/Const_46",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/Shape_4",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/SelectV2_18",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "1" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_45",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/ExpandDims_4",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": {
                                "dim": [{ "size": "1" }, { "size": "1" }]
                            }
                        }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/Cast_14",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "1" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/Const_47",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/Const_44",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_158/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/split_41",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "16" },
                                    { "size": "5" }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "unknown_108",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "5" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_159/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/SelectV2_21",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "1" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/zeros_5",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/Const_49",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/Shape_5",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/SelectV2_22",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "1" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/Const_48",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/ExpandDims_5",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": {
                                "dim": [{ "size": "1" }, { "size": "1" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Cast_16",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "1" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_50",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net1/decoder/Concat_16/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/SelectV2_25",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "1" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/zeros_6",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_52",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/Shape_6",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/SelectV2_26",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "1" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/Const_51",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/ExpandDims_6",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT64" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": {
                                "dim": [{ "size": "1" }, { "size": "1" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Cast_18",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": { "dim": [{ "size": "1" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/Const_53",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT64", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT64" }
                }
            },
            {
                "name": "PartitionedCall/Const_54",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_161/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Reshape_17",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "4" },
                                    { "size": "1" }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_162/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_2",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_15/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Reshape_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "4" },
                                    { "size": "1" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/transpose_16/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net1/decoder/convGRU4/gru_cell/Concat/axis",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_36",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_144/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/split_37",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "20" },
                                    { "size": "20" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "unknown_98",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "20" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_145/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_37",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "2" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net1/decoder/convGRU4/gru_cell/Split/split_dim",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net1/decoder/convGRU4/gru_cell/Concat_1/axis",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_38",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_147/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/split_38",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "20" },
                                    { "size": "10" }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "unknown_100",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "10" }] }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/transpose_148/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_6/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net1/decoder/convGRU3/gru_cell/Concat/axis",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_28",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_133/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/split_34",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "24" },
                                    { "size": "24" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "unknown_90",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "24" }] }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/transpose_134/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_29",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "2" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net1/decoder/convGRU3/gru_cell/Split/split_dim",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net1/decoder/convGRU3/gru_cell/Concat_1/axis",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_30",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_136/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/split_35",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "24" },
                                    { "size": "12" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "unknown_92",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "12" }] }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/transpose_137/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_8/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net1/decoder/convGRU2/gru_cell/Concat/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Const_20",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_122/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/split_31",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "32" },
                                    { "size": "32" }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "unknown_82",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "32" }] }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "PartitionedCall/transpose_123/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/Const_21",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "2" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net1/decoder/convGRU2/gru_cell/Split/split_dim",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net1/decoder/convGRU2/gru_cell/Concat_1/axis",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_22",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_125/perm",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/split_32",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "32" },
                                    { "size": "16" }
                                ]
                            }
                        }
                    },
                    "dtype": { "type": "DT_FLOAT" }
                }
            },
            {
                "name": "unknown_84",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_FLOAT" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": { "dim": [{ "size": "16" }] }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_126/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/transpose_10/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/_net/_net1/decoder/convGRU1/gru_cell/Concat/axis",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": { "dtype": "DT_INT32", "tensorShape": {} }
                    }
                }
            },
            {
                "name": "PartitionedCall/Const_12",
                "op": "Const",
                "attr": {
                    "dtype": { "type": "DT_INT32" },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [{ "size": "4" }, { "size": "2" }]
                            }
                        }
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_111/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": { "dim": [{ "size": "4" }] }
                        }
                    },
                    "dtype": { "type": "DT_INT32" }
                }
            },
            {
                "name": "PartitionedCall/split_28",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    { "size": "3" },
                                    { "size": "3" },
                                    { "size": "40" },
                                    { "size": "40" }
                                ]
                            }
